<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="input_ids" type="Parameter" version="opset1">
			<data shape="1,77" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_65_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="49408, 768" offset="0" size="75890688" />
			<output>
				<port id="0" precision="FP16" names="45,weight.55">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_65" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.text_model/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="75890688" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="37">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.text_model/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="38,input_ids">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.text_model.embeddings.token_embedding/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="1133">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.text_model.embeddings.token_embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="7" name="__module.text_model.embeddings.token_embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>77</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="46,inputs_embeds">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_70_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="77, 768" offset="75890700" size="118272" />
			<output>
				<port id="0" precision="FP16" names="47,weight.57">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_70" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.text_model.embeddings/aten::slice/Slice" type="Const" version="opset1">
			<data element_type="i64" shape="1, 77" offset="76008972" size="616" />
			<output>
				<port id="0" precision="I64" names="43">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_26636" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="76009588" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_26637" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="76009588" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_26633" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="76009596" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.text_model.embeddings/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_23450" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009604" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.text_model.embeddings/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="17" name="__module.text_model.embeddings/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="42">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_26632" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ScatterUpdate_26638" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_26641" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="76009608" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.text_model.embeddings/aten::slice/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="44,input.1">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.text_model.embeddings.position_embedding/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.text_model.embeddings.position_embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="24" name="__module.text_model.embeddings.position_embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>77</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="48,position_embeddings">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.text_model.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="49,input.3">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009616" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_30545_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="76009620" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_30545" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_30546_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="76011156" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_30546" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102,hidden_states.1">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_30105_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="76012692" size="1179648" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_30105" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Multiply_30056" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_30547_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="77192340" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_30547" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.text_model.encoder.layers.0.self_attn/aten::mul/Multiply" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="114,tensor.5">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.text_model.encoder.layers.0.self_attn/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="30" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="30" />
			</output>
		</layer>
		<layer id="42" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="43" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="107" />
			</output>
		</layer>
		<layer id="44" name="Constant_12122" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="77193876" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_23453" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009604" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="48" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="109">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193884" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193888" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="133">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="134">
					<dim>1</dim>
					<dim>77</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="77193892" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="13" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="77193884" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="13" />
			</output>
		</layer>
		<layer id="56" name="__module.text_model.encoder.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="129,130,131,132,149,150" />
			</output>
		</layer>
		<layer id="57" name="Constant_12126" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="77193876" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_0_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009616" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_1_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193888" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" names="137,139,141">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138,query_states.1">
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_204_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="77193908" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="116,weight.63">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_204" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.text_model.encoder.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_30548_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="78373556" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_30548" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.text_model.encoder.layers.0.self_attn.k_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="117,tensor.1">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_0_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009616" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_1_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193884" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_2_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193888" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="118,125">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="119">
					<dim>1</dim>
					<dim>77</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="77193892" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="140,key_states.3">
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.text_model.encoder.layers.0.self_attn/aten::bmm/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145,attn_weights.1">
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_0_4" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="77193884" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.text_model.encoder.layers.0.self_attn/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>77</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_23456" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009604" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="82" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="143">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="146">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="147">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.text_model/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="86" name="__module.text_model/aten::full/Broadcast" type="Const" version="opset1">
			<data element_type="f32" shape="77, 77" offset="78375092" size="23716" />
			<output>
				<port id="0" precision="FP32" names="53_1">
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.text_model/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="28" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="76009616" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="28" />
			</output>
		</layer>
		<layer id="89" name="__module.text_model/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="75890696" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="__module.text_model/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="54,57" />
			</output>
		</layer>
		<layer id="91" name="__module.text_model/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="76009604" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="92" name="__module.text_model/aten::arange/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.text_model/aten::arange/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="55,mask_cond">
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_30549" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009604" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.text_model/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="56">
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_12142" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="77193876" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.text_model/prim::ListConstruct/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.text_model/prim::ListConstruct/Reshape_0_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="76009604" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.text_model/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="58">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.text_model/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32">
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="59">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.text_model/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="60">
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.text_model/aten::masked_fill_/ConvertLike_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="78398808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="103" name="__module.text_model/aten::masked_fill_/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="104" name="__module.text_model/aten::masked_fill_/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="53,62,mask,mask.1">
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.text_model/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="63">
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="29" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="76009604" size="4" />
			<output>
				<port id="0" precision="I32" names="29" />
			</output>
		</layer>
		<layer id="107" name="__module.text_model/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_26649" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="78398810" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_26652" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="78398822" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_26655" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="78398846" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.text_model/aten::slice/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="65">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_26661" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="78398858" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_26664" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="78398874" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_26667" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="78398906" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.text_model/aten::slice/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="66">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.text_model/aten::expand/Select" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="78398922" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.text_model/aten::expand/Broadcast_2" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="70,causal_attention_mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.text_model.encoder.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="148,attn_weights.3">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_5" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" names="151">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="152,input.5">
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.text_model.encoder.layers.0.self_attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="153,input.7">
					<dim>12</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_237_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="78398938" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="123,weight.65">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_237" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.text_model.encoder.layers.0.self_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_30550_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="79578586" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_30550" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
